# PreFit

This notebook was built in Snowflake Notebooks

## 1. SQL

### 1.1 Duplicate emails

Write a SQL query to report all the duplicate emails.

In [ ]:
-- DDL
DROP TABLE IF EXISTS PERSONS;
CREATE TABLE IF NOT EXISTS PERSONS (
    id INTEGER,
    email VARCHAR
);

-- DML
INSERT INTO PERSONS (id, email) VALUES
    (1, 'a@b.com'),
    (2, 'c@d.com'),
    (3, 'a@b.com');

SELECT *
FROM PERSONS;

In [ ]:
-- DQL
SELECT email
FROM PERSONS
GROUP BY email
HAVING COUNT(1) >= 2;

### 1.2 Distance between two points

Write a SQL query to report the shortest distance between any two points from the Point2D table. Round the difference to two decimal points

Formula
$$
distance = \sqrt{(x_{2} - x_{1})^{2} + (y_{2} - y_{1})^{2}}
$$

In [ ]:
-- DDL
DROP TABLE IF EXISTS POINT2D;
CREATE TABLE IF NOT EXISTS POINT2D (
    x NUMERIC,
    y NUMERIC
);

INSERT INTO POINT2D (x, y) VALUES
    (-1, -1),
    (0, 0),
    (-1, -2);

SELECT *
FROM POINT2D;

In [ ]:
-- DQL
SELECT ROUND(SQRT(POW(point_1.x - point_2.x, 2) + POW(point_1.y - point_2.y, 2)), 2) AS shortest
FROM POINT2D AS point_1, POINT2D AS point_2 -- Cartesian
WHERE (point_1.x != point_2.x OR point_1.y != point_2.y)
ORDER BY 1 ASC
LIMIT 1;

### 1.3 Swap the seat id

Write a SQL query to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by `id` in ascending order.

Input:
```
+----+---------+
| id | student |
+----+---------+
| 1  | Abbot   |
| 2  | Doris   |
| 3  | Emerson |
| 4  | Green   |
| 5  | Jeames  |
+----+---------+
```

Output:
```
+----+---------+
| id | student |
+----+---------+
| 1  | Doris   |
| 2  | Abbot   |
| 3  | Green   |
| 4  | Emerson |
| 5  | Jeames  |
+----+---------+
```

In [ ]:
-- DDL
DROP TABLE IF EXISTS SEAT;
CREATE TABLE IF NOT EXISTS SEAT (
    id INTEGER,
    student VARCHAR
);

INSERT INTO SEAT (id, student) VALUES
    (1, 'Abbot'),
    (2, 'Doris'),
    (3, 'Emerson'),
    (4, 'Green'),
    (5, 'Jeames');

SELECT *
FROM SEAT;

In [ ]:
-- DQL
SELECT 
    (CASE 
        WHEN id % 2 = 0 THEN id - 1 
        WHEN id % 2 = 1 AND id < (SELECT COUNT(*) FROM Seat) THEN id + 1 
        ELSE id 
    END) AS "id", student
FROM Seat
ORDER BY 1;

## 2. Algorithms

### 2.1 Roman to number

Roman numerals are represented by seven different symbols: I, V, X, L, C, D and M.

Symbol value:
- I: 1
- V: 5
- X: 10
- L: 50
- C: 100
- D: 500
- M: 1000

For example, 2 is written as II in Roman numeral, just to ones added together. 12 is written as XII, which is simply X + II. The number 27 is written as XXVII, which is XX + V + II.

Roman numerals are usually written largest to smallest from left to right. However, the numeral for four is not IIII. Instead, the number four is written as IV. Because the one is befjore the five we subtract it making four. The same principle applies to the number nine, which is written as IX.

Example 1:
input: s = "III"; Output: 3

Example 2:
input: s = "LVIII"; Output: 58

Example 3:
input: s = "MCMXCIV"; Output: 1994

In [ ]:
def roman_to_number(roman: str) -> int:
    # dict with roman numbers equivalent
    roman_values = {
        "I": 1,
        "V": 5,
        "X": 10,
        "L": 50,
        "C": 100,
        "D": 500,
        "M": 1000
    }

    # Result to return
    result = 0

    # Foor loop
    for i in range(len(roman)):
        # If isn't the last one
        ## and if the current number is less than the next number
        if i + 1 < len(roman) and roman_values[roman[i]] < roman_values[roman[i + 1]]:
            result -= roman_values[roman[i]]
        else:
            result += roman_values[roman[i]]

    return result
    

# Asserts for tests
assert roman_to_number("III") == 3
assert roman_to_number("LVIII") == 58
assert roman_to_number("MCMXCIV") == 1994

print("Algorithm runs successfully! :)")

### 2.2 Add two numbers up to target

Given an array of integer nums and an integer target, return indices of the two numbers such that they add up to target. You may assume that each input would have exactly one solution, and you may not use the same element twice.

Example 1:
input: nums = [2,7,11,15], target = 9; Output: [0, 1]

Example 2:
input: nums = [3,2,4]; target = 6; output: [1, 2]

Example 3:
input: nums = [3, 3], target = 6; output: [0, 1]

In [ ]:
def add_two_numbers(nums: list[int], target: int) -> list[int]:
    # List to return
    result = [0, 0]

    # Store Target - number
    difference_target = {}

    # For loop
    for i in range(len(nums)):
        if target - nums[i] in difference_target:
            result[0] = difference_target[target - nums[i]]
            result[1] = i

            # Exit the for loop
            break
        else:
            difference_target[nums[i]] = i

    
    
    return result

# Asserts to validate
assert add_two_numbers([2, 7, 11, 15], 9) == [0, 1]
assert add_two_numbers([3, 2, 4], 6) == [1, 2]
assert add_two_numbers([3, 3], 6) == [0, 1]

print("Algorithm runs successfully! :)")